Revit 2027 API
AlphanumericRevisionSettings(IList<String>, String, String) Constructor
 Constructs an AlphanumericRevisionSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AlphanumericRevisionSettings(
	IList<string> sequence,
	string prefix,
	string suffix
)
Public Sub New (
	sequence As IList(Of String),
	prefix As String,
	suffix As String
)
public:
AlphanumericRevisionSettings(
	IList<String^>^ sequence,
	String^ prefix,
	String^ suffix
)
new :
        sequence : IList<string> *
        prefix : string *
        suffix : string -> AlphanumericRevisionSettings
Parameters
sequence IList<String>
The custom sequence to be used as numbers for revisions with the Alphanumeric RevisionNumberType.
If there are more alphanumeric revisions than there are strings in the sequence, subsequent alphanumeric revisions will be assigned duplicated characters. For example, if the sequence provided were ["X", "Y"], the first alphanumeric revision would be shown as "X", the second as "Y", the third as "XX", then "YY", "XXX", etc.
prefix String
 The prefix string for each revision number in the sequence.
suffix String
 The suffix string for each revision number in the sequence.
Exceptions
Exception | Condition
ArgumentException |  Input sequence contains invalid entries.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AlphanumericRevisionSettings Class
AlphanumericRevisionSettings Overload
Autodesk.Revit.DB Namespace